[
  {
    "id": "luca_faloni_0",
    "shop_id": "luca_faloni",
    "url": "https://lucafaloni.com",
    "title": "Italian Luxury Menswear: Cashmere, Linen & Leather | Luca Faloni",
    "section": "other",
    "text": "Mid-Season Icons DISCOVER LOOKBOOK Best Sellers FEATURED COLLECTIONS Lightweight Knitwear Mid-Season Shirts Trousers About us We source the finest natural materials across Italy and work with the most skilled artisans in the country to design and craft our permanent collection directly for you. Our story and philosophy Finest materials Italian craftsmanship LF Journal JUL 8, 2025 5 min Crafted by Hand, Inspired by Life: Sandra, Our Artisan from Bergamo MAY 13, 2025 5 min Summer Aperitivo MAY 14, 2025 5 min Ricordi d'Estate: A Postcard from Positano JUL 8, 2025 5 min Crafted by Hand, Inspired by Life: Sandra, Our Artisan from Bergamo MAY 13, 2025 5 min Summer Aperitivo MAY 14, 2025 5 min Ricordi d'Estate: A Postcard from Positano VIEW ALL ARTICLES",
    "lang": "en",
    "ts_fetched": "2025-08-27T03:29:50.205996",
    "meta": {
      "origin": "Italian",
      "craftsmanship": "handmade"
    }
  },
  {
    "id": "luca_faloni_1",
    "shop_id": "luca_faloni",
    "url": "https://lucafaloni.com/pages/our-story",
    "title": "Our Story: Italian Craftsmanship & Luxury | Luca Faloni",
    "section": "about",
    "text": "OUR STORY & PHILOSOPHY \"Our pursuit is to deliver superior craftsmanship and create a true 'Made in Italy' proposition available directly to our clients worldwide.\" OUR STORY & PHILOSOPHY \"Our pursuit is to deliver superior craftsmanship and create a true 'Made in Italy' proposition available directly to our clients worldwide.\" Finest materials Finest materials We promise to source the finest materials from the most prestigious Italian producers. We only use pure cashmere and silk-cashmere from one of the most renowned Italian mills, linen from one of Italy’s oldest weaving houses, brushed cotton from a prestigious shirting specialist, piqué from a historic mill in Veneto, and full-grain leather from Santa Croce, Tuscany. These producers rely on a long history of traditions and expertise to produce sustainable fabrics, offering the highest durability, comfort and quality, able to stand the test of time for each of our designs. Italian Craftsmanship Italian Craftsmanship We take great pride in partnering with skilled artisans in various regions of Italy, renowned for their exceptional craftsmanship. They continuously improve their skills relying on learnings passed down through generations. This allows us to give you better and more durable products, by accessing expert knowledge and technique. We build deep-rooted friendships with our artisans and carry out business through transparent and fair means. We are committed to conserving our ‘Made In Italy’ heritage by securing their future. Integrity Integrity Founded on the philosophy of slow fashion, we deliver elegant designs that never go out of fashion. Creating a permanent wardrobe above the following trends is for us a fundamental step towards no waste and a sustainable clothing industry. Being a product specialist, we believe in building upon our experience, listening to our customers and meticulously refining each garment year after year. The integrity of our direct-to-client model gives superior quality and exceptional craftsmanship at a fair price the whole year to all our customers, never going on seasonal sales. Our client's aspirations are paramount and we deliver these with a premium service. Our Journey Luca Faloni grew up in Italy surrounded by a strong culture of artisanal craftsmanship and quality of fabrics. It was only when he moved abroad, that he realised the quality and style he took for granted was something rare and less accessible elsewhere. He also noticed that many Italian brands were abandoning the local artisans. The idea was born to fuse exceptional Italian craftsmanship and style, with modern distribution channels, to make great products easily available worldwide and provide stronger value to the customer. We travelled across all regions of Italy to select the most experienced artisans, who have refined their craft over generations, and to source materials from the most prestigious Italian producers. We gradually extended to categories where we thought we could provide more value and better designs to our customers. We are here to serve clients with a worldly lifestyle, who value quality and timeless designs, and to make it easier for them to find great products for all their needs. We are Italian at heart, but cosmopolitan in our vision and always focused on how craftsmanship improves lifestyle. FINEST MATERIALS ITALIAN CRAFTSMANSHIP FEATURED COLLECTIONS LINEN SHIRTS SUMMER TROUSERS SUMMER POLOS",
    "lang": "en",
    "ts_fetched": "2025-08-27T03:29:51.453958",
    "meta": {
      "origin": "Italian",
      "craftsmanship": "handmade"
    }
  },
  {
    "id": "luca_faloni_2",
    "shop_id": "luca_faloni",
    "url": "https://lucafaloni.com/pages/faq",
    "title": "FAQ - Luxury Menswear Questions & Support | Luca Faloni",
    "section": "policy",
    "text": "WEBSITE & PRODUCTS ORDERS & SHIPPING RETURNS & EXCHANGES If you have any questions, please contact our customer care team. Monday to Friday, from 9 AM to 6 PM (GMT). +1 (332) 262-7146 WhatsApp Email",
    "lang": "en",
    "ts_fetched": "2025-08-27T03:29:52.668515",
    "meta": {}
  },
  {
    "id": "luca_faloni_3",
    "shop_id": "luca_faloni",
    "url": "https://lucafaloni.com/pages/care-guide",
    "title": "Garment Care Guide: Cashmere, Linen & More | Luca Faloni",
    "section": "policy",
    "text": "Linen Linen Jersey Cotton Cotton Piqué Silk-Cotton Cashmere-Cotton Cashmere Silk-Cashmere Leather Luca Faloni Maintenance Service We offer an exclusive, complimentary in-store service to help preserve the quality and longevity of your cherished cashmere. +1 (332) 262-7146 WhatsApp Email Get in touch with our customer service team for more details, or drop by our stores .",
    "lang": "en",
    "ts_fetched": "2025-08-27T03:29:55.126781",
    "meta": {}
  },
  {
    "id": "luca_faloni_4",
    "shop_id": "luca_faloni",
    "url": "https://lucafaloni.com/pages/size-guide",
    "title": "Italian Luxury Menswear: Cashmere, Linen & Leather | Luca Faloni",
    "section": "policy",
    "text": "Mid-Season Icons DISCOVER LOOKBOOK Best Sellers FEATURED COLLECTIONS Lightweight Knitwear Mid-Season Shirts Trousers About us We source the finest natural materials across Italy and work with the most skilled artisans in the country to design and craft our permanent collection directly for you. Our story and philosophy Finest materials Italian craftsmanship LF Journal JUL 8, 2025 5 min Crafted by Hand, Inspired by Life: Sandra, Our Artisan from Bergamo MAY 13, 2025 5 min Summer Aperitivo MAY 14, 2025 5 min Ricordi d'Estate: A Postcard from Positano JUL 8, 2025 5 min Crafted by Hand, Inspired by Life: Sandra, Our Artisan from Bergamo MAY 13, 2025 5 min Summer Aperitivo MAY 14, 2025 5 min Ricordi d'Estate: A Postcard from Positano VIEW ALL ARTICLES",
    "lang": "en",
    "ts_fetched": "2025-08-27T03:29:56.431400",
    "meta": {
      "origin": "Italian",
      "craftsmanship": "handmade"
    }
  }
]